[{"userName":"Sir. Norville Rogers","userBlog":"Like Zoinks Man! Like we got this social platform Up an' running man., now all we needs a server","postTime":1550175689},
    {"userName":"The Admin","userBlog":"where do the Spirit Halloween stores come from. They never sit there like most stores the building that they come into are empty the whole rest of the year, but when October rolls around the Spirit Halloweens just seem to pop-up, filling in those empty stores. What seems like overnight these once empty buildings fill up with giant displays, costume racks, computers, and Halloween decorations galore. But how do they do it? Another one of the main focuses of our site will be, “Where do the Spirit Halloween stores go?”. Have you ever seen a Spirit Halloween getting packed up? They just put everything on sale then two days later they’re gone, banner down, lights off, walls bare, just as if they had never been there in the first place. Has it ever left you wondering what happened to them? How they got out of there so fast? How they got out of there so quickly? They come and go like a specter in the night, almost like Spirit Halloween is a sort of Spirit of it’s own, possessing buildings all around the country but then when spooky season is over they have to leave so they put everything on sale so as not to arouse suspicion then they vanish back to wherever they came from to prepare for their return in another year. Finally, we need to bring forth what the true intentions of Spirit Halloween are, whatever they may be. We will use the community to piece together the mystery of what Spirit Halloweens purpose here on earth is. What is it that they desire? Why do they only open for one month out of the year? How do they appear? why do they appear? Why are they so expensive on things that normally wouldn’t cost much but are so reasonably priced on things that would normally be very expensive? There are so many questions to ask, and we need each other to find the answers."},
    {"userName":"","userBlog":"","postTime":1550175689}
]